[
  {
    "code": "implication",
    "label": "Implication et attitude en classe",
    "icon": "fa-user-check",
    "suggestions": [
      "Montre peu d’implication et attend souvent les consignes.",
      "S’implique ponctuellement mais pourrait participer davantage.",
      "Participe de manière régulière et reste concentré.",
      "S’implique activement et aide ses camarades.",
      "Attitude exemplaire, entraîne positivement le groupe."
    ],
    "improvements": [
      "Essayez de vous impliquer davantage en posant une question par séance.",
      "Poursuivez vos efforts et cherchez à participer plus régulièrement.",
      "Continuez sur cette lancée et partagez vos idées avec confiance.",
      "Maintenez cette attitude proactive et inspirez vos camarades."
    ]
  },
  {
    "code": "comprehension",
    "label": "Compréhension et acquisition des savoirs",
    "icon": "fa-brain",
    "suggestions": [
      "Compréhension fragile des notions abordées.",
      "Assimile les notions essentielles avec quelques hésitations.",
      "Compréhension solide des notions étudiées.",
      "Mobilise aisément ses connaissances dans les activités.",
      "Maîtrise approfondie et apporte des éclairages pertinents."
    ],
    "improvements": [
      "Relisez vos notes après chaque cours pour renforcer votre compréhension.",
      "Posez des questions dès que vous avez un doute pour clarifier les notions.",
      "Enrichissez votre réflexion en reliant théorie et pratique.",
      "Expliquez les concepts à un camarade pour consolider votre maîtrise."
    ]
  },
  {
    "code": "travail",
    "label": "Travail personnel et régularité",
    "icon": "fa-clock",
    "suggestions": [
      "Travail irrégulier et consignes peu respectées.",
      "Travail satisfaisant mais pourrait gagner en constance.",
      "Travail sérieux et régulier.",
      "Travail rigoureux et toujours rendu dans les délais.",
      "Organisation exemplaire et grand sens des priorités."
    ],
    "improvements": [
      "Organisez une liste de tâches à accomplir chaque jour.",
      "Fixez-vous des échéances claires pour chaque travail.",
      "Planifiez vos sessions de travail en avance pour plus de régularité.",
      "Maintenez cette rigueur et anticipez toujours vos besoins."
    ]
  },
  {
    "code": "savoir_etre",
    "label": "Savoir-être professionnel",
    "icon": "fa-user-tie",
    "suggestions": [
      "Comportement à améliorer, respecte difficilement le cadre.",
      "Attitude correcte mais parfois inconstante.",
      "Attitude positive et respectueuse.",
      "Savoir-être professionnel affirmé et rassurant.",
      "Attitude exemplaire et fédératrice."
    ],
    "improvements": [
      "Rappelez-vous de respecter ponctualité et consignes à chaque séance.",
      "Travaillez votre communication avec vos pairs pour un meilleur échange.",
      "Proposez régulièrement votre aide pour renforcer votre esprit d’équipe.",
      "Continuez d’incarner un savoir-être exemplaire pour vos camarades."
    ]
  }
]
