[
  {
    "code": "implication",
    "label": "Implication et attitude en classe",
    "icon": "fa-user-check",
    "suggestions": [
      "Analyse les consignes et reformule pour s’assurer de bien comprendre.",
      "Planifie ses actions et avance méthodiquement dans les tâches proposées.",
      "Partage ses idées et contribue activement aux échanges du groupe.",
      "Demande des retours pour progresser et ajuste ses méthodes de travail.",
      "Fait preuve d’autonomie tout en sollicitant l’aide appropriée si nécessaire."
    ],
    "improvements": [
      "Essayez de vous impliquer davantage en posant une question par séance.",
      "Poursuivez vos efforts et cherchez à participer plus régulièrement.",
      "Continuez sur cette lancée et partagez vos idées avec confiance.",
      "Maintenez cette attitude proactive et inspirez vos camarades."
    ]
  },
  {
    "code": "technique",
    "label": "Compétences techniques / professionnelles",
    "icon": "fa-wrench",
    "suggestions": [
      "Rencontre des difficultés à utiliser les outils de base.",
      "Manque de précision dans l’exécution des tâches techniques.",
      "A besoin d’un accompagnement fréquent pour réaliser les opérations.",
      "Éprouve des hésitations dans l’application des procédures.",
      "Respecte partiellement les normes de sécurité élémentaires.",
      "Sait reproduire les gestes appris sans autonomie complète.",
      "Montre une compréhension basique des outils professionnels.",
      "Accomplit les tâches techniques avec guidance régulière.",
      "Commence à respecter les règles de sécurité de manière sporadique.",
      "Maîtrise les opérations élémentaires en situation guidée.",
      "Prend en compte les consignes de sécurité avec régularité.",
      "Montre une rigueur correcte dans le maniement des équipements.",
      "Accomplit les travaux techniques de façon fiable et répétée.",
      "Démontre une bonne compréhension des protocoles professionnels.",
      "Exécute les tâches techniques avec précision et méthode.",
      "Utilise efficacement les outils en respectant les normes.",
      "Fait preuve d’autonomie et de soin dans le travail technique.",
      "Anticipe les difficultés et ajuste sa méthode de travail.",
      "Maîtrise les gestes professionnels complexes de façon constante.",
      "Donne l’exemple en matière de qualité et de sécurité."
    ],
    "improvements": [
      "Pratiquez les gestes de base régulièrement pour gagner en confiance.",
      "Consolidez vos acquis en vous exerçant sur des cas simples.",
      "Défiez-vous sur des tâches plus complexes pour gagner en autonomie.",
      "Continuez d’affiner vos compétences et partagez votre savoir-faire."
    ]
  },
  {
    "code": "comprehension",
    "label": "Compréhension et acquisition des savoirs",
    "icon": "fa-brain",
    "suggestions": [
      "Analyse les consignes et reformule pour s’assurer de bien comprendre.",
      "Planifie ses actions et avance méthodiquement dans les tâches proposées.",
      "Partage ses idées et contribue activement aux échanges du groupe.",
      "Demande des retours pour progresser et ajuste ses méthodes de travail.",
      "Fait preuve d’autonomie tout en sollicitant l’aide appropriée si nécessaire."
    ],
    "improvements": [
      "Relisez vos notes après chaque cours pour renforcer votre compréhension.",
      "Posez des questions dès que vous avez un doute pour clarifier les notions.",
      "Enrichissez votre réflexion en reliant théorie et pratique.",
      "Expliquez les concepts à un camarade pour consolider votre maîtrise."
    ]
  },
  {
    "code": "travail",
    "label": "Travail personnel et régularité",
    "icon": "fa-clock",
    "suggestions": [
      "Analyse les consignes et reformule pour s’assurer de bien comprendre.",
      "Planifie ses actions et avance méthodiquement dans les tâches proposées.",
      "Partage ses idées et contribue activement aux échanges du groupe.",
      "Demande des retours pour progresser et ajuste ses méthodes de travail.",
      "Fait preuve d’autonomie tout en sollicitant l’aide appropriée si nécessaire."
    ],
    "improvements": [
      "Organisez une liste de tâches à accomplir chaque jour.",
      "Fixez-vous des échéances claires pour chaque travail.",
      "Planifiez vos sessions de travail en avance pour plus de régularité.",
      "Maintenez cette rigueur et anticipez toujours vos besoins."
    ]
  },
  {
    "code": "savoir_etre",
    "label": "Savoir-être professionnel",
    "icon": "fa-user-tie",
    "suggestions": [
      "Analyse les consignes et reformule pour s’assurer de bien comprendre.",
      "Planifie ses actions et avance méthodiquement dans les tâches proposées.",
      "Partage ses idées et contribue activement aux échanges du groupe.",
      "Demande des retours pour progresser et ajuste ses méthodes de travail.",
      "Fait preuve d’autonomie tout en sollicitant l’aide appropriée si nécessaire."
    ],
    "improvements": [
      "Rappelez-vous de respecter ponctualité et consignes à chaque séance.",
      "Travaillez votre communication avec vos pairs pour un meilleur échange.",
      "Proposez régulièrement votre aide pour renforcer votre esprit d’équipe.",
      "Continuez d’incarner un savoir-être exemplaire pour vos camarades."
    ]
  },
  {
    "code": "progression",
    "label": "Progression",
    "icon": "fa-chart-line",
    "suggestions": [
      "N’a pas montré d’évolution notable depuis le début du semestre.",
      "Progrès limités, à consolider régulièrement les fondamentaux.",
      "Progression irrégulière et sujette à encadrement permanent.",
      "Avance lentement avec recul sur certaines notions.",
      "Progrès perceptibles mais sans suivi clair.",
      "Évolution modérée, à renforcer par un travail ciblé.",
      "Montre une amélioration progressive sur quelques points.",
      "Progrès constants dans les tâches guidées.",
      "Avance régulièrement sur les exercices pratiques.",
      "S’adapte progressivement en autonomie.",
      "Amélioration sensible dans la compréhension des méthodes.",
      "Acquiert de nouvelles compétences à un rythme satisfaisant.",
      "Progression régulière avec initiatives ponctuelles.",
      "Évolution notable sur plusieurs critères.",
      "S’inscrit dans une dynamique positive de progression.",
      "Démontre une constance dans le développement de ses acquis.",
      "Excelle dans sa progression et ses résultats sont en nette amélioration.",
      "Affine sans cesse ses compétences et perfectionne son savoir.",
      "Donne l’exemple par sa progression continue et motivée."
    ],
    "improvements": [
      "Identifiez un point clé à améliorer chaque semaine.",
      "Fixez-vous de petits objectifs pour mesurer votre progression.",
      "Célébrez vos progrès et définissez un nouveau défi.",
      "Continuez à vous challenger pour maintenir votre évolution."
    ]
  }
]