[
  {
    "code": "implication",
    "label": "Implication et attitude en classe",
    "icon": "fa-user-check",
    "suggestions": [
      "Participe activement aux échanges et montre une vraie motivation.",
      "S’investit pleinement dans chaque activité proposée.",
      "Prend des initiatives pour faire avancer le travail collectif.",
      "Reste concentré et attentif tout au long des séances.",
      "Encourage ses camarades et crée une dynamique positive."
    ],
    "improvements": [
      "Essayez de vous impliquer davantage en posant une question par séance.",
      "Poursuivez vos efforts et cherchez à participer plus régulièrement.",
      "Continuez sur cette lancée et partagez vos idées avec confiance.",
      "Maintenez cette attitude proactive et inspirez vos camarades."
    ]
  },
  {
    "code": "comprehension",
    "label": "Compréhension et acquisition des savoirs",
    "icon": "fa-brain",
    "suggestions": [
      "Assimile rapidement les nouvelles notions abordées.",
      "Fait des liens pertinents entre les cours et les exercices.",
      "Explique clairement ses démarches pour vérifier sa compréhension.",
      "Réinvestit les connaissances vues en classe dans ses travaux.",
      "Anticipe les difficultés et cherche à approfondir ses savoirs."
    ],
    "improvements": [
      "Relisez vos notes après chaque cours pour renforcer votre compréhension.",
      "Posez des questions dès que vous avez un doute pour clarifier les notions.",
      "Enrichissez votre réflexion en reliant théorie et pratique.",
      "Expliquez les concepts à un camarade pour consolider votre maîtrise."
    ]
  },
  {
    "code": "travail",
    "label": "Travail personnel et régularité",
    "icon": "fa-clock",
    "suggestions": [
      "Fournit un travail régulier et soigné.",
      "Respecte les échéances fixées avec sérieux.",
      "S’organise efficacement pour mener à bien ses missions.",
      "Persévère malgré les obstacles rencontrés.",
      "Sait prioriser les tâches pour gagner en efficacité."
    ],
    "improvements": [
      "Organisez une liste de tâches à accomplir chaque jour.",
      "Fixez-vous des échéances claires pour chaque travail.",
      "Planifiez vos sessions de travail en avance pour plus de régularité.",
      "Maintenez cette rigueur et anticipez toujours vos besoins."
    ]
  },
  {
    "code": "savoir_etre",
    "label": "Savoir-être professionnel",
    "icon": "fa-user-tie",
    "suggestions": [
      "Adopte une attitude respectueuse avec tous les membres du groupe.",
      "Fait preuve d’écoute et de bienveillance au quotidien.",
      "S’adapte facilement aux différentes situations rencontrées.",
      "Garde son calme et gère positivement les imprévus.",
      "Renforce la cohésion du groupe par son comportement exemplaire."
    ],
    "improvements": [
      "Rappelez-vous de respecter ponctualité et consignes à chaque séance.",
      "Travaillez votre communication avec vos pairs pour un meilleur échange.",
      "Proposez régulièrement votre aide pour renforcer votre esprit d’équipe.",
      "Continuez d’incarner un savoir-être exemplaire pour vos camarades."
    ]
  }
]
